In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [35]:
df.sample(4, random_state=5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
463509,Senior Data Engineer,Senior Data Engineer,"Hartford, CT",via LinkedIn,Full-time,False,"Illinois, United States",2023-02-17 14:12:32,False,False,United States,year,160000.0,NaN,Alldus,"['python', 'sql', 'snowflake']","{'cloud': ['snowflake'], 'programming': ['pyth..."
675218,Business Analyst,Tableau Developer / Business Analyst,"Kraków, Poland",via SmartRecruiters Job Search,Full-time,False,Poland,2023-06-28 11:08:17,False,False,Poland,None,NaN,NaN,zooplus SE,"['sql', 'aws', 'oracle', 'tableau', 'sap']","{'analyst_tools': ['tableau', 'sap'], 'cloud':..."
774597,Data Analyst,ELECT - Data Analyst 2,"Tennessee, IL",via BeBee,Full-time,False,"Illinois, United States",2023-09-29 01:01:43,True,True,United States,None,NaN,NaN,"Yakshna Solutions, Inc.","['sql', 't-sql', 'sql server', 'elasticsearch'...","{'analyst_tools': ['ssis', 'tableau', 'ssrs'],..."
522891,Data Analyst,Data Analyst,"Chicago, IL",via Jobs Trabajo.org,Full-time,False,"Illinois, United States",2023-08-25 11:02:29,False,False,United States,None,NaN,NaN,Chicago Public Schools - CPS,"['sas', 'sas', 'r', 'spss']","{'analyst_tools': ['sas', 'spss'], 'programmin..."

In [38]:
df_altered = df.copy()
df_altered.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [39]:
median_salary = df_altered['salary_year_avg'].median()
median_salary

115000.0

In [40]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)
df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [41]:
df.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [42]:
id(df)

2993431411920

In [43]:
id(df_altered)

2993482323408

In [44]:
id(df) == id(df_altered)

False